<a href="https://colab.research.google.com/github/bitprj/DigitalHistory/blob/master/Week6-Advanced-Data-Wrangling-using-Pandas/Advanced_Data_Wrangling_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src="https://github.com/bitprj/DigitalHistory/blob/Narae/Week3-Introduction-to-Open-Data-Importing-Data-and-Basic-Data-Wrangling/assets/icons/bitproject.png?raw=1" width="200" align="left"> 
<img src="https://github.com/bitprj/DigitalHistory/blob/Narae/Week3-Introduction-to-Open-Data-Importing-Data-and-Basic-Data-Wrangling/assets/icons/data-science.jpg?raw=1" width="300" align="right">

# <div align="center">Advanced Data Wrangling with Pandas</div>

## Table of Contents

- Series
    - Creating a Series
    - Sorting a Series
        - **1.0 - Now Try This**
    - Accessing an element in a Series
        - **2.0 - Now Try This**
        - **3.0 - Now Try This**
    - Binary Operations
        - **4.0 - Now Try This**

- Advanced Dataframe
    - Creaing new columns
    - Replacing NaN values
    - Sorting the dataset
    - Selecting subset of data
        - **5.0 - Now Try This**
    - Dropping entities
    - Unique values in columns
    - Joining dataset
        - Merge
        - Join

- Practical Exercise: Flight Delay data
    - Join dataset
    - Groupby
    - Filtering based on condition
    - **6.0 - Now Try This**
    - **7.0 - Now Try This**
    - **8.0 - Now Try This**
    - **9.0 - Now Try This**

## Dataframe vs. Series
There are two main data structures you need to get comfortable with: **Dataframes** and **Series** (Remember: we covered the basics of Dataframes in Week 3.)

To refresh your memory, **Dataframes** are tabular, column-oriented data structures with both row and column labels. 

**Series** is a 1-dimensional labeled array and it can hold data of any type (integer, string, float, python objects, etc.). Series has indices and data values and it is similar to dictionary as it is a mapping of indices to data values.

### Grading

There are a total of 9 questions and each question is worth 1 point.

In order to work on the Homework sections and submit them for grading, you'll need to run the code block below. It will ask for your student ID number and then create a folder that will house your answers for each question. At the very end of the notebook, there is a code section that will download this folder as a zip file to your computer. This zip file will be your final submission.

In [ ]:
import os
import shutil

!rm -rf sample_data

student_id = input('Please Enter your Student ID: ') # Enter Student ID.

while len(student_id) != 9:
 student_id = int('Please Enter your Student ID: ')  
  
folder_location = f'{student_id}/Week_Twelve/Now_Try_This'
if not os.path.exists(folder_location):
  os.makedirs(folder_location)
  print('Successfully Created Directory, Lets get started')
else:
  print('Directory Already Exists')

## Series

### Creating a Series

A series can be created from a:
1. scalar
2. list
2. dictionary

First and foremost, let's import the Pandas library.

In [ ]:
import pandas as pd

#### 1. Creating a Series from Scalars

In [ ]:
pd.Series(3)

0    3
dtype: int64

In [ ]:
pd.Series(3, index =[0, 1, 2, 3, 4, 5])

0    3
1    3
2    3
3    3
4    3
5    3
dtype: int64

#### 2-1. Creating a Series from a List w/o Indices. 

By default, indices start at 0 and end at len(array) - 1. 

In this example, as we didn't specify the index, the first index is 0 and the last index is 3, which is len(array)-1.

In [ ]:
aList = ['a','b','c']
pd.Series(aList)

0    a
1    b
2    c
dtype: object

#### 2-2. Creating a Series from a List with Indices

If we want to assign a different index instead of the default ones, we can specify that.

In [ ]:
array = ['a','b','c','d']
pd.Series(array,index=[1,2,3,4])

1    a
2    b
3    c
4    d
dtype: object

Using the examples below, we can check if indices must be sorted. In this example, the indices are not sorted (105 --> 103 --> 102 --> 109 --> 104 --> 110). Let's see what it returns!

In [ ]:
names = ['Daisy', 'Matt', 'Kelly', 'Mike', 'Ashley', 'Kyle']
pd.Series(names, index=[105,103,102,109,104,110])

105     Daisy
103      Matt
102     Kelly
109      Mike
104    Ashley
110      Kyle
dtype: object

Then, the question is "Are the indices unique?"
Let's check it out!

In [ ]:
names = ['Daisy', 'Matt', 'Kelly', 'Mike', 'Ashley', 'Kyle']
s = pd.Series(names, index=[100,100,102,102,103,110])
s

The indices don't have to be unique!

Can we use non-numerical indices?
Let's check it out!

In [ ]:
names = ['Daisy', 'Matt', 'Kelly', 'Mike', 'Narae']
cities=["Atlanta", "San Francisco", "New York", "Seattle", "Atlanta"]

s = pd.Series(names, index=cities)
s

Atlanta          Daisy
San Francisco     Matt
New York         Kelly
Seattle           Mike
Atlanta          Narae
dtype: object

In [ ]:
s['Atlanta']

Atlanta    Daisy
Atlanta    Narae
dtype: object

We found out that the indices don't have to be numbers.

In [ ]:
names = ['Daisy', 'Matt', 'Kelly', 'Mike']
index_list = [0.79, -5, 13, "Hello"]
pd.Series(names, index=index_list)

0.79     Daisy
-5        Matt
13       Kelly
Hello     Mike
dtype: object

We used a float, positive and negative integers, and a string as indices and it worked! 

This example is to demonstrate that you can use any datatype as indices; in the real world, it's more common to keep the datatype consistent for indices.

#### 3. Creating a Series from a Dictionary
We can create a Series from a **dictionary**! Let's see how it works!

In [ ]:
# aDict stores how many fruits we have.
aDict = {'Apple':3, 'Banana':5, 'Cherry': 2, 'Mango': 13, 'Peach': 10}
pd.Series(aDict)

Apple      3
Banana     5
Cherry     2
Mango     13
Peach     10
dtype: int64

When we are passing `aDict` to `pd.Series()`, the order in which the fruits were added is preserved in `aDict`.

In [ ]:
aDict = {'Mango': 13, 'Banana':5, 'Cherry':2, 'Apple': 3, 'Peach': 10}
pd.Series(aDict)

Mango     13
Banana     5
Cherry     2
Apple      3
Peach     10
dtype: int64

If we want to know the datatype of a Series, we can call the `dtype` function.

In [ ]:
aDict = {'Mango': 13, 'Banana':5, 'Cherry':2, 'Apple': 3, 'Peach': 10}
pd.Series(aDict).dtype

dtype('int64')

Now, let's change the value for "Mango." We will change the value to 13.45 and see what `dtype` returns!

In [ ]:
aDict = {'Mango': 13.45, 'Banana':5, 'Cherry':2, 'Apple': 3, 'Peach': "hello"}
pd.Series(aDict).dtype

dtype('O')

If we want to print out indices only, we can use the ```index``` property.

In [ ]:
aDict = {'Mango': 13.45, 'Banana':5, 'Cherry':2, 'Apple': 3, 'Peach': 10}
pd.Series(aDict).index

Index(['Mango', 'Banana', 'Cherry', 'Apple', 'Peach'], dtype='object')

We can print out the values of a Series in a similar way. We can just use the ```values``` property instead.

In [ ]:
pd.Series(aDict).values

array([13.45,  5.  ,  2.  ,  3.  , 10.  ])

### Sorting a Series

If we want to sort the Series by "index", we can use the ```sort_index()``` function.

In [ ]:
s = pd.Series(aDict)
s.sort_index()

Apple      3.00
Banana     5.00
Cherry     2.00
Mango     13.45
Peach     10.00
dtype: float64

Similarly, if we want to sort the series based on values, we can use the `sort_values` function. By default, it will sort the elements in ascending order.

In [ ]:
s = pd.Series(aDict)
s.sort_values()

Cherry     2.00
Apple      3.00
Banana     5.00
Peach     10.00
Mango     13.45
dtype: float64

Let's sort the series in descending order.

In [ ]:
s.sort_values(ascending=False)

Mango     13.45
Peach     10.00
Banana     5.00
Apple      3.00
Cherry     2.00
dtype: float64

### 1.0 - Now Try This
Sort the series by index in descending order.

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/1.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

### Accessing an Element in a Series

We can access elements in a Series in the following ways:
- by index number
- by index label

In [ ]:
array = ['a','b','c','d','e','f','g','h']
s = pd.Series(array)
s

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

#### 1. By Index Number

We can access the first element by index number 0.

In [ ]:
s[0]

'a'

In [ ]:
s[5]

'f'

We can access the first 3 elements with slicing operation [:3]

In [ ]:
s[:3]

0    a
1    b
2    c
dtype: object

### 2.0 - Now Try This

Access the items in the 3-5 indices (inclusive) using slicing operations.

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/2.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

#### By Index Label


We can retrieve a single element using index labels.

In [ ]:
aDict = {'Apple':3, 'Banana':5, 'Cherry': 2, 'Peach': 10}
s = pd.Series(aDict)
s['Apple']

3

In [ ]:
s['Peach']

10

### 3.0 - Now Try This

In [ ]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

Retrieve the element that corresponds to index 'd'.

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/3.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

### Binary Operations of Series
- Add
- Sub
- Mul

Here, we have created two Series with numbers.

In [ ]:
# creating a first series
s1 = pd.Series([1,5,6,2])
 
# creating a second series
s2 = pd.Series([4,1,3,5])

Let's add the two Series!

In [ ]:
# answer = s1 + s2
answer = s1.add(s2)
print(answer)

0    5
1    6
2    9
3    7
dtype: int64

We can also subtract a Series from another using the `sub()` function.

In [ ]:
# answer = s1 - s2
answer = s1.sub(s2)
print(answer)

0   -3
1    4
2    3
3   -3
dtype: int64

Finally, we can multiply two Series using the `mul()` function.

In [ ]:
answer = s1.mul(s2)
print(answer)

0     4
1     5
2    18
3    10
dtype: int64

We can also perform these operations using simple mathematical notation and it will give us the same result.

In [ ]:
s1 + s2

0    5
1    6
2    9
3    7
dtype: int64

In [ ]:
s1 - s2

0   -3
1    4
2    3
3   -3
dtype: int64

In [ ]:
s1 * s2

0     4
1     5
2    18
3    10
dtype: int64

In [ ]:
s1 / s2

0    0.25
1    5.00
2    2.00
3    0.40
dtype: float64

Now, let's create two Series with indices. Note that the order of indices is different in the two Series.

In [4]:
# creating a first series
s1 = pd.Series([1,5,6,2], index=['b','c','d','a'])
 
# creating a second series
s2 = pd.Series([4,1,3,5], index=['a','b','c','d'])

In [ ]:
s1 + s2

a     6
b     2
c     8
d    11
dtype: int64

The resulting Series' value for `'a'` is `6` is because `s1['a'] + s2['a'] = 6`. All the other values are calculated in the same way.

### 4.0 - Now Try This

Write down what you think this code will print out on a piece of paper.
Compare your answer with the actual output of the code.

In [6]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/4.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.

# RUN THIS CODE BLOCK -- no additional codes needed
s1 = pd.Series([1,5,6,2], index=['b','c','d','a'])
s2 = pd.Series([4,1,3,5], index=['a','b','c','d'])

# Write down what you think this code will print out on a piece of paper.
s1 * s2

a     8
b     1
c    15
d    30
dtype: int64

Now, let's put in string values in a series and see how binary operations work with strings.

In [ ]:
# creating a first series
s1 = pd.Series(["apple","banana","Mango","Pecan"], index=['b','c','d','a'])
 
# creating a second series
s2 = pd.Series(["pie","pie","bread","smoothie"], index=['a','b','c','d'])

s1+ " " +s2

a         Pecan pie
b         apple pie
c      banana bread
d    Mango smoothie
dtype: object

## Advanced Dataframes

Now, let's move onto some more advanced ways to use Dataframes. To demonstrate this, we'll be using a dataframe for the following dataset.

In [ ]:
data = {'First Name': ['Jennifer', 'Chris', 'John', 'Annie', 'Chloe', 'Jeremy', 'Allison', 'Hannah'], 
        'Last Name': ['Brown', 'Smith', 'Williams', 'Wong', 'Anderson', 'Scott', 'Kim', 'Mills'], 
        'Age': [16, 32, 21, 35, 27, 42, 28, 23],
        'Hourly Wage': [8,14,60,44,80,54,32,16],
        'Hours per week': [20,28,40,40,32,40,40,20],
        'Years of experience': [0,2,None,9,None,4,5,None]
        } 

emp = pd.DataFrame(data)
emp

  First Name Last Name  Age  Hourly Wage  Hours per week  Years of experience
0   Jennifer     Brown   16            8              20                  0.0
1      Chris     Smith   32           14              28                  2.0
2       John  Williams   21           60              40                  NaN
3      Annie      Wong   35           44              40                  9.0
4      Chloe  Anderson   27           80              32                  NaN
5     Jeremy     Scott   42           54              40                  4.0
6    Allison       Kim   28           32              40                  5.0
7     Hannah     Mills   23           16              20                  NaN

### Creating New Columns

#### String Manipulation

We want to have a column displaying the full names of the people in the dataset. To do this, we can combine First Name and Last Name and create a new column called "Full Name."

The ```' '``` in the middle is adding a space between the first name and last name.

In [ ]:
# string manipulation
emp['Full Name'] = emp['First Name'] + ' ' + emp['Last Name']
emp

  First Name Last Name  ...  Years of experience       Full Name
0   Jennifer     Brown  ...                  0.0  Jennifer Brown
1      Chris     Smith  ...                  2.0     Chris Smith
2       John  Williams  ...                  NaN   John Williams
3      Annie      Wong  ...                  9.0      Annie Wong
4      Chloe  Anderson  ...                  NaN  Chloe Anderson
5     Jeremy     Scott  ...                  4.0    Jeremy Scott
6    Allison       Kim  ...                  5.0     Allison Kim
7     Hannah     Mills  ...                  NaN    Hannah Mills

[8 rows x 7 columns]

#### Numerical Column

Let's calculate weekly salary for each person and add a column called ```Weekly Salary```. We need to do some simple math to get this.

In [ ]:
# multiplication of two numerical columns
emp['Weekly Salary'] = emp['Hourly Wage'] * emp['Hours per week']
emp

  First Name Last Name  Age  ...  Years of experience       Full Name  Weekly Salary
0   Jennifer     Brown   16  ...                  0.0  Jennifer Brown            160
1      Chris     Smith   32  ...                  2.0     Chris Smith            392
2       John  Williams   21  ...                  NaN   John Williams           2400
3      Annie      Wong   35  ...                  9.0      Annie Wong           1760
4      Chloe  Anderson   27  ...                  NaN  Chloe Anderson           2560
5     Jeremy     Scott   42  ...                  4.0    Jeremy Scott           2160
6    Allison       Kim   28  ...                  5.0     Allison Kim           1280
7     Hannah     Mills   23  ...                  NaN    Hannah Mills            320

[8 rows x 8 columns]

Now, we've added two columns "Full Name" and "Weekly Salary."

#### List Comprehension

Let's create a new column called ```High Income``` based on the ```Weekly Salary```. We will use a list comprehension for this (you can refer to Week 2 materials if you can't recall what list comprehensions are.)

```High Income``` will be ```True``` if ```Weekly Salary``` is > 2000, otherwise `False`.

In [ ]:
# list comprehension
emp['High Income'] = [True if x > 2000 else False for x in emp['Weekly Salary']]
emp

### Fill in NaN values

There are lots of ```NaN``` values (missing values) in ```Years of experience```.

Let's fill in these missing values with 0's using ```fillna(0)```.

In [ ]:
emp['Years of experience'].fillna(0)
emp

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
0   Jennifer     Brown   16  ...  Jennifer Brown            160        False
1      Chris     Smith   32  ...     Chris Smith            392        False
2       John  Williams   21  ...   John Williams           2400         True
3      Annie      Wong   35  ...      Annie Wong           1760        False
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True
6    Allison       Kim   28  ...     Allison Kim           1280        False
7     Hannah     Mills   23  ...    Hannah Mills            320        False

[8 rows x 9 columns]

If we want to replace all missing values in the dataset, we can call ```fillna(0)``` on the dataframe itself.

In [ ]:
emp.fillna(0)

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
0   Jennifer     Brown   16  ...  Jennifer Brown            160        False
1      Chris     Smith   32  ...     Chris Smith            392        False
2       John  Williams   21  ...   John Williams           2400         True
3      Annie      Wong   35  ...      Annie Wong           1760        False
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True
6    Allison       Kim   28  ...     Allison Kim           1280        False
7     Hannah     Mills   23  ...    Hannah Mills            320        False

[8 rows x 9 columns]

### Sorting the Dataset

Let's sort the data by 'Weekly Salary'.

In [ ]:
emp.sort_values(by='Weekly Salary')

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
0   Jennifer     Brown   16  ...  Jennifer Brown            160        False
7     Hannah     Mills   23  ...    Hannah Mills            320        False
1      Chris     Smith   32  ...     Chris Smith            392        False
6    Allison       Kim   28  ...     Allison Kim           1280        False
3      Annie      Wong   35  ...      Annie Wong           1760        False
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True
2       John  Williams   21  ...   John Williams           2400         True
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True

[8 rows x 9 columns]

Now, all of the high income workers are located at the bottom of the dataset.

### Selecting a Subset of Data based on a Condition

Let's review how we can select subsets of data based on specified criteria.

Selecting rows where 'High Income' is True:

In [ ]:
filter = emp['High Income'] == True
emp[filter]

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
2       John  Williams   21  ...   John Williams           2400         True
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True

[3 rows x 9 columns]

### 5.0 - Now Try This

Let's find people who are younger than 30 AND have high income.

(Hint: Make sure to use ```()``` on each condition.)

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/5.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

### Dropping Rows

There are two ways of dropping rows.

1. ```df.drop(index #)```
2. ```df.drop(df[<some boolean condition>].index)```: 

The first line is used when we know exactly which rows we want to drop from the dataframe.
We use the second line to drop rows that do not meet certain criteria.

Let's drop rows where 'High Income' is False.

In [ ]:
filter = emp['High Income'] == False
emp.drop(emp[filter].index)

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
2       John  Williams   21  ...   John Williams           2400         True
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True

[3 rows x 9 columns]

In [ ]:
emp

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
0   Jennifer     Brown   16  ...  Jennifer Brown            160        False
1      Chris     Smith   32  ...     Chris Smith            392        False
2       John  Williams   21  ...   John Williams           2400         True
3      Annie      Wong   35  ...      Annie Wong           1760        False
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True
6    Allison       Kim   28  ...     Allison Kim           1280        False
7     Hannah     Mills   23  ...    Hannah Mills            320        False

[8 rows x 9 columns]

Even though we dropped the columns where High Income == False, `emp` remains unchanged.

This is because we didn't update `emp`!

We can update the dataframe once we drop the rows by setting ```inplace=True```.

In [ ]:
filter = emp['High Income'] == False
emp.drop(emp[filter].index, inplace=True)

In [ ]:
emp

  First Name Last Name  Age  ...       Full Name  Weekly Salary  High Income
2       John  Williams   21  ...   John Williams           2400         True
4      Chloe  Anderson   27  ...  Chloe Anderson           2560         True
5     Jeremy     Scott   42  ...    Jeremy Scott           2160         True

[3 rows x 9 columns]

Here we go! `emp` has been updated!

### Company Dataframe

Here, we have a dataset containing each person from  ```emp``` as well as information about what companies they work for.

In [ ]:
data = {'First Name': ['Jennifer', 'Chris', 'John', 'Annie', 'Chloe', 'Jeremy', 'Allison', 'Hannah'], 
        'Last Name': ['Brown', 'Smith', 'Williams', 'Wong', 'Anderson', 'Scott', 'Kim', 'Mills'], 
        'Company': ['Home Depot', 'Bit Project', 'Microsoft', 'Bit Project', 'Disney', None, 'Home Depot', None]
        } 

companies = pd.DataFrame(data)
companies

  First Name Last Name      Company
0   Jennifer     Brown   Home Depot
1      Chris     Smith  Bit Project
2       John  Williams    Microsoft
3      Annie      Wong  Bit Project
4      Chloe  Anderson       Disney
5     Jeremy     Scott         None
6    Allison       Kim   Home Depot
7     Hannah     Mills         None

### Fill in NaN values

In the dataframe, Hannah's company is ```NaN```. Let's replace it with a string "UNKNOWN".

In [ ]:
companies['Company'].fillna('UNKNOWN', inplace = True)

In [ ]:
companies

  First Name Last Name      Company
0   Jennifer     Brown   Home Depot
1      Chris     Smith  Bit Project
2       John  Williams    Microsoft
3      Annie      Wong  Bit Project
4      Chloe  Anderson       Disney
5     Jeremy     Scott      UNKNOWN
6    Allison       Kim   Home Depot
7     Hannah     Mills      UNKNOWN

### Unique Values in a Column

Let's find out the unique company names in the dataframe.

```df[[column_name]].drop_duplicates()```

This code will drop duplicates in the ```column_name```!

In [ ]:
companies[["Company"]].drop_duplicates()

       Company
0   Home Depot
1  Bit Project
2    Microsoft
4       Disney
5      UNKNOWN

#### Count Unique Values

With the ```groupby()``` and ```size()``` functions, we can count the occurrences of an unique value in a specific column.

In [ ]:
companies.groupby(['Company']).size()

Company
Bit Project    2
Disney         1
Home Depot     2
Microsoft      1
UNKNOWN        2
dtype: int64

The code above groups by ```Company``` and return the number of times each company appears in the ```Company``` column.

If we want to sort by the size or count, we can use ```sort_values```.

In [ ]:
companies.groupby(['Company']).size().sort_values()

Company
Disney         1
Microsoft      1
Bit Project    2
Home Depot     2
UNKNOWN        2
dtype: int64

#### The Number of Unique Values

To find out the number of unique values in a column, we can use ```nunique()```.

```nunique()``` can be interpreted as **n**umber of **unique** values.

In [ ]:
companies["Company"].nunique()

5

These three functions will be very helpful when working with a large, complicated dataset!

### Joining Datasets

Let's join the two tables ```emp``` and ```companies``` to find out which companies those people work for.

### 1. Merge

These are the parameters we can use when we merge two dataframes.

```DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes='_x', '_y', copy=True, indicator=False, validate=None)```

- how: {‘inner’, ‘left’, ‘right’, ‘outer’}, default ‘inner’
- on: Column or index level names to join on. These must be found in both DataFrames.
- left_on: Column or index level names to join on in the left DataFrame.
- right_on: Column or index level names to join on in the right DataFrame.
- suffixes: An optional parameter. Each element gets a suffix of length 2 to distinguish between information from duplicate column names in left and right dataframes, respectively.

We will cover the most fundamental and commonly used parameters here. Feel free to check for more details at https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

#### Merge - `how`

```how``` indicates a type of ```join``` and there are 4 types: ```inner```, ```left```, ```right```, and ```outer```.

![inner_join.png](https://github.com/bitprj/DigitalHistory/blob/Narae/Week6-Advanced-Data-Wrangling-using-Pandas/assets/Inner_join_new.png?raw=1)

```inner join``` will take in the common items / columns between the two dataframes.

![left_join.png](https://github.com/bitprj/DigitalHistory/blob/Narae/Week6-Advanced-Data-Wrangling-using-Pandas/assets/Left_join_new.png?raw=1)

```left join``` will include everything from left dataframe as well as any data from the right dataframe where they both have the same column values.

![right_join.png](https://github.com/bitprj/DigitalHistory/blob/Narae/Week6-Advanced-Data-Wrangling-using-Pandas/assets/Right_join_new.png?raw=1)

Similar to ```left join```, ```right join``` will include everything from the right dataframe as well as any data from the left dataframe where they both have the same column values.

![full_join.png](https://github.com/bitprj/DigitalHistory/blob/Narae/Week6-Advanced-Data-Wrangling-using-Pandas/assets/Outer_join_new.png?raw=1)

```outer join``` will include everything from left and right dataframes even if there aren't any common items between the two.

Understanding the different types of ```join```s are very important as this will help us to determine which type of ```join``` we will perform on a dataframe.

#### Merge - `how` Example:

In this example, we can merge ```emp``` and ```companies```. The code below will return a dataframe comprised of the two merged objects.

In [ ]:
pd.merge(emp, companies)

  First Name Last Name  Age  ...  Weekly Salary  High Income    Company
0       John  Williams   21  ...           2400         True  Microsoft
1      Chloe  Anderson   27  ...           2560         True     Disney
2     Jeremy     Scott   42  ...           2160         True     Adidas

[3 rows x 10 columns]

Yay, it worked! 

We dropped the rows from ```emp``` where an employee's weekly salary is less than $2000, so the updated ```emp``` has 3 rows. By default, ```merge``` performs ```inner join``` and that's why it's showing less rows than ```companies```.

Now, let's try ```right_join``` and see how it works!

In [ ]:
pd.merge(emp, companies, how='right')

  First Name Last Name   Age  ...  Weekly Salary  High Income      Company
0   Jennifer     Brown   NaN  ...            NaN          NaN   Home Depot
1      Chris     Smith   NaN  ...            NaN          NaN  Bit Project
2       John  Williams  21.0  ...         2400.0         True    Microsoft
3      Annie      Wong   NaN  ...            NaN          NaN  Bit Project
4      Chloe  Anderson  27.0  ...         2560.0         True       Disney
5     Jeremy     Scott  42.0  ...         2160.0         True       Adidas
6    Allison       Kim   NaN  ...            NaN          NaN   Home Depot
7     Hannah     Mills   NaN  ...            NaN          NaN      UNKNOWN

[8 rows x 10 columns]

As our right dataframe is ```companies``` with 8 rows, the result shows all of the 8 employees in ```companies```. But as we've dropped the rows that do not meet our salary expectation in ```emp```, the result of ```right_join``` is missing ```Age```, ```Hourly Wage```, ```Hours per week```, etc for some employees.

#### Merge - `on`, `left_on`, `right_on`

```on```, ```left_on```, and ```right_on``` indicate column names to join on.

- ```on``` is used when the same column name exists in both dataframes.
- ```left_on``` and ```right_on``` is used when the column names are different in the two dataframes.

#### Merge - `on` Example

Let's join the two dataframes using common column names, ```First Name``` and ```Last Name```.

In [ ]:
pd.merge(emp, companies, on=['First Name', 'Last Name'])

  First Name Last Name  Age  ...  Weekly Salary  High Income    Company
0       John  Williams   21  ...           2400         True  Microsoft
1      Chloe  Anderson   27  ...           2560         True     Disney
2     Jeremy     Scott   42  ...           2160         True     Adidas

[3 rows x 10 columns]

The resulting dataset shows three rows, since ```inner join``` was performed by default.

#### Merge - `left_on`, `right_on` Example

It might happen that the two dataframes we want to merge have different column names. In this case, we will have to specify the two column names.

Let's join the two dataframes using different column names. 

- ```emp``` column name: ```Full Name``` 
- ```companies``` column name: ```Name```

In [ ]:
companies['Name'] = companies['First Name'] + ' ' + companies['Last Name']
companies

  First Name Last Name      Company            Name
0   Jennifer     Brown   Home Depot  Jennifer Brown
1      Chris     Smith  Bit Project     Chris Smith
2       John  Williams    Microsoft   John Williams
3      Annie      Wong  Bit Project      Annie Wong
4      Chloe  Anderson       Disney  Chloe Anderson
5     Jeremy     Scott       Adidas    Jeremy Scott
6    Allison       Kim   Home Depot     Allison Kim
7     Hannah     Mills      UNKNOWN    Hannah Mills

In [ ]:
pd.merge(emp, companies, left_on='Full Name', right_on='Name')

  First Name_x Last Name_x  Age  ...  Last Name_y    Company            Name
0         John    Williams   21  ...     Williams  Microsoft   John Williams
1        Chloe    Anderson   27  ...     Anderson     Disney  Chloe Anderson
2       Jeremy       Scott   42  ...        Scott     Adidas    Jeremy Scott

[3 rows x 13 columns]

As mentioned earlier, by default, ```inner join``` has been applied and the resulting dataframe shows 3 rows!

In the result, ```First Name_x``` is from the first table, which is ```emp```, while ```First Name_y``` is from the second table, which is ```companies```.

#### Merge - `suffixes`

Suffixes indicate the suffix to add to duplicate column names in left and right dataframes respectively.

In the previous example, by default, suffixes ```_x``` and ```_y``` were added respectively.

We can specify suffixes by setting ```suffixes=[]```.

#### Merge - `suffixes` Example

Let's add ```_1``` to the first dataframe and ```_2``` to the second dataframe.

In [ ]:
pd.merge(emp, companies, left_on='Full Name', right_on='Name', suffixes=['_1', '_2'])

  First Name_1 Last Name_1  Age  ...  Last Name_2    Company            Name
0         John    Williams   21  ...     Williams  Microsoft   John Williams
1        Chloe    Anderson   27  ...     Anderson     Disney  Chloe Anderson
2       Jeremy       Scott   42  ...        Scott     Adidas    Jeremy Scott

[3 rows x 13 columns]

Since `inner join` was performed, only 3 common rows show up and so there's actually no need to indicate ```_1``` or ```_2```.

Let's try `right join` and see how the dataframe looks different!

In [ ]:
pd.merge(emp, companies, how = 'right', left_on='Full Name', right_on='Name', suffixes=['_emp', '_companies'])

  First Name_emp Last Name_emp  ...      Company            Name
0            NaN           NaN  ...   Home Depot  Jennifer Brown
1            NaN           NaN  ...  Bit Project     Chris Smith
2           John      Williams  ...    Microsoft   John Williams
3            NaN           NaN  ...  Bit Project      Annie Wong
4          Chloe      Anderson  ...       Disney  Chloe Anderson
5         Jeremy         Scott  ...       Adidas    Jeremy Scott
6            NaN           NaN  ...   Home Depot     Allison Kim
7            NaN           NaN  ...      UNKNOWN    Hannah Mills

[8 rows x 13 columns]

Because we specified `right join`, it shows all of the rows from the ```companies``` dataframe and matching rows from the ```emp``` dataframe.

The ```First Name_emp``` and ```Last Name_emp``` show three rows only while ```First Name_companies``` and ```Last Name_companies``` show all rows!

### 2. Join

These are the parameters we can use when we merge two dataframes.

```Dataframe.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)```

- `other`: Dataframe, Series, or list of Dataframes to join.
- on: Column or index level names to join on the index in `other`. These must be found in both DataFrames.
- how: {‘inner’, ‘left’, ‘right’, ‘outer’}, default ‘inner’
- lsuffix: Suffix to use from left frame’s overlapping columns.
- rsuffix: Suffix to use from right frame’s overlapping columns.

We have covered ```on``` and ```how``` in detail in ```merge```. Feel free to click [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) for a revision.

We will try one example of ```join``` using ```lsuffix``` and ```rsuffix```.

#### Join - `lsuffix` and `rsuffix`

This is similar to ```suffixes``` in ```merge```.

In [ ]:
emp.join(companies, how='right', lsuffix='_1', rsuffix='_2')

  First Name_1 Last Name_1   Age  ...  Last Name_2      Company            Name
0          NaN         NaN   NaN  ...        Brown   Home Depot  Jennifer Brown
1          NaN         NaN   NaN  ...        Smith  Bit Project     Chris Smith
2         John    Williams  21.0  ...     Williams    Microsoft   John Williams
3          NaN         NaN   NaN  ...         Wong  Bit Project      Annie Wong
4        Chloe    Anderson  27.0  ...     Anderson       Disney  Chloe Anderson
5       Jeremy       Scott  42.0  ...        Scott       Adidas    Jeremy Scott
6          NaN         NaN   NaN  ...          Kim   Home Depot     Allison Kim
7          NaN         NaN   NaN  ...        Mills      UNKNOWN    Hannah Mills

[8 rows x 13 columns]

## Practical Exercise - Flight delay data 

You can find the dataset here:
https://www.kaggle.com/divyansh22/flight-delay-prediction

Now, we will dive into a more complicated data analysis using Pandas.

<img src="https://github.com/bitprj/DigitalHistory/blob/Narae/Week6-Advanced-Data-Wrangling-using-Pandas/assets/icons/flight.jpg?raw=1" width="300" align="right"> 

From the page itself:

"This dataset is the flight delay prediction for the month of January. 

This data is collected from the Bureau of Transportation Statistics, Govt. of the USA. This data is open-sourced under U.S. Govt. Works. This dataset contains all the flights in the month of January 2020. There are more than 400,000 flights in the month of January itself throughout the United States. The features were manually chosen to do a primary time series analysis. There are several other features available on their website.

This data could well be used to predict the flight delay at the destination airport specifically for the month of January in upcoming years as the data is for January only".

In [ ]:
url = 'https://raw.githubusercontent.com/bitprj/DigitalHistory/master/Week6-Advanced-Data-Wrangling-using-Pandas/data/Jan_2020_ontime.csv'
df = pd.read_csv(url)
df

        DAY_OF_MONTH  DAY_OF_WEEK  ... DISTANCE  Unnamed: 21
0                  1            3  ...    174.0          NaN
1                  1            3  ...    585.0          NaN
2                  1            3  ...    631.0          NaN
3                  1            3  ...    253.0          NaN
4                  1            3  ...   1157.0          NaN
...              ...          ...  ...      ...          ...
607341            31            5  ...    443.0          NaN
607342            31            5  ...    509.0          NaN
607343            31            5  ...    610.0          NaN
607344            31            5  ...    589.0          NaN
607345            31            5  ...    589.0          NaN

[607346 rows x 22 columns]

As always, the first thing we need to do is get an idea of what data looks like!
We can call three functions here:
- `head()`
- `describe()`
- `info()`

In [ ]:
df

In [ ]:
df.head()

   DAY_OF_MONTH  DAY_OF_WEEK OP_UNIQUE_CARRIER  ...  DIVERTED DISTANCE Unnamed: 21
0             1            3                EV  ...       0.0    174.0         NaN
1             1            3                EV  ...       0.0    585.0         NaN
2             1            3                EV  ...       0.0    631.0         NaN
3             1            3                EV  ...       0.0    253.0         NaN
4             1            3                EV  ...       0.0   1157.0         NaN

[5 rows x 22 columns]

In [ ]:
df.describe()

        DAY_OF_MONTH    DAY_OF_WEEK  ...       DISTANCE  Unnamed: 21
count  607346.000000  607346.000000  ...  607346.000000          0.0
mean       16.014354       3.955735  ...     798.022341          NaN
std         8.990719       1.910205  ...     587.282639          NaN
min         1.000000       1.000000  ...      31.000000          NaN
25%         8.000000       2.000000  ...     369.000000          NaN
50%        16.000000       4.000000  ...     641.000000          NaN
75%        24.000000       5.000000  ...    1037.000000          NaN
max        31.000000       7.000000  ...    5095.000000          NaN

[8 rows x 16 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607346 entries, 0 to 607345
Data columns (total 22 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   DAY_OF_MONTH           607346 non-null  int64
 1   DAY_OF_WEEK            607346 non-null  int64
 2   OP_UNIQUE_CARRIER      607346 non-null  object
 3   OP_CARRIER_AIRLINE_ID  607346 non-null  int64
 4   OP_CARRIER             607346 non-null  object
 5   TAIL_NUM               606648 non-null  object
 6   OP_CARRIER_FL_NUM      607346 non-null  int64
 7   ORIGIN_AIRPORT_ID      607346 non-null  int64
 8   ORIGIN_AIRPORT_SEQ_ID  607346 non-null  int64
 9   ORIGIN                 607346 non-null  object
 10  DEST_AIRPORT_ID        607346 non-null  int64
 11  DEST_AIRPORT_SEQ_ID    607346 non-null  int64
 12  DEST                   607346 non-null  object
 13  DEP_TIME               600682 non-null  float64
 14  DEP_DEL15              600647 non-null  float64
 15  DEP_TIME_BLK           607346 non-null  object
 16  ARR_TIME               600271 non-null  float64
 17  ARR_DEL15              599268 non-null  float64
 18  CANCELLED              607346 non-null  float64
 19  DIVERTED               607346 non-null  float64
 20  DISTANCE               607346 non-null  float64
 21  Unnamed: 21            0 non-null       float64
dtypes: float64(8), int64(8), object(6)
memory usage: 101.9+ MB

### Columns to use:
- Day_of_week: Day of Week starting from Monday
  - Ex: Monday = 1, Sunday = 7
- Op_unique_carrier: Unique Carrier Code (DL, WN, AA, 9E, OO, etc.)
- Origin: Origin Airport (JFK, ATL, SFO, LAX, etc.)
- Dest: Destination Airport (JFK, ATL, SFO, LAX, etc.)
- Dep_time: Actual Departure Time (local time: hhmm)
  - Ex: 1848 is 18:48 in local time
- Dep_del15: Departure Delay Indicator, 15 Minutes or More (1=Yes, 0=No)
- Arr_time: Actual Arrival Time (local time: hhmm)
- Arr_del15: Arrival Delay Indicator, 15 Minutes or More (1=Yes, 0=No)
- Cancelled: Cancelled Flight Indicator (1=Yes, 0=No)
- Diverted: Diverted Flight Indicator (1=Yes, 0=No)
- Distance: Distance between airports (miles)

We are going to select the columns to use using ```[]```.

In [ ]:
flight = df[["DAY_OF_WEEK", "OP_UNIQUE_CARRIER", "ORIGIN", "DEST", "DEP_TIME", "DEP_DEL15", "ARR_TIME", "ARR_DEL15", "CANCELLED", "DIVERTED", "DISTANCE"]]
flight

        DAY_OF_WEEK OP_UNIQUE_CARRIER ORIGIN  ... CANCELLED  DIVERTED  DISTANCE
0                 3                EV    ORD  ...       0.0       0.0     174.0
1                 3                EV    TUL  ...       0.0       0.0     585.0
2                 3                EV    EWR  ...       0.0       0.0     631.0
3                 3                EV    BTR  ...       0.0       0.0     253.0
4                 3                EV    RIC  ...       0.0       0.0    1157.0
...             ...               ...    ...  ...       ...       ...       ...
607341            5                9E    TYS  ...       0.0       0.0     443.0
607342            5                9E    DTW  ...       0.0       0.0     509.0
607343            5                9E    GSP  ...       0.0       0.0     610.0
607344            5                9E    ATL  ...       0.0       0.0     589.0
607345            5                9E    XNA  ...       0.0       0.0     589.0

[607346 rows x 11 columns]

### 6.0 - Now Try This

Let's retrieve unique airline codes (```OP_UNIQUE_CARRIER```) from the dataframe.

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/6.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

**Q: We know DL (Delta Air Lines), AA (American Airlines) and a few more major airlines. But, do we know all of the unique carrier codes?**

**A: No, we don't! Let's add airline names from another dataset!**

### Join datasets
- ```flight``` dataframe has ```OP_UNIQUE_CARRIER```, but it is missing airline names.
- ```airline_names.xlsx``` has airline codes as well as the airline names we need.

Let's join the ```flight``` dataframe with ```airline_names.xlsx``` to get all the airline names.

In [ ]:
url = 'https://raw.githubusercontent.com/bitprj/DigitalHistory/master/Week6-Advanced-Data-Wrangling-using-Pandas/data/airline_names.xlsx'
airline = pd.read_excel(url)
airline

   carrier                 carrier_name
0       9E            Endeavor Air Inc.
1       AA       American Airlines Inc.
2       AQ          Aloha Airlines Inc.
3       AS         Alaska Airlines Inc.
4       B6              JetBlue Airways
5       CO   Continental Air Lines Inc.
6       DL         Delta Air Lines Inc.
7       EV      ExpressJet Airlines LLC
8       F9       Frontier Airlines Inc.
9       FL  AirTran Airways Corporation
10      G4                Allegiant Air
11      HA       Hawaiian Airlines Inc.
12      HP   America West Airlines Inc.
13      MQ                    Envoy Air
14      NK             Spirit Air Lines
15      NW      Northwest Airlines Inc.
16      OH                  Comair Inc.
17      OO        SkyWest Airlines Inc.
18      RU     ExpressJet Airlines Inc.
19      TZ       ATA Airlines d/b/a ATA
20      UA        United Air Lines Inc.
21      US              US Airways Inc.
22      VX               Virgin America
23      WN       Southwest Airlines Co.
24      XE     ExpressJet Airlines Inc.
25      YV           Mesa Airlines Inc.
26      YX             Republic Airline

### 7.0 - Now Try This

- Use the ```merge``` function to join the ```airline``` dataframe with the ```flight``` dataframe.
- Name the resulting dataframe as ```flight_airline```.
- Print ```flight_airline``` and make sure that this dataframe has airline codes AND all airline names!

(Hint: what are the common column names between two dataframes? Are the column names the same?)

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/7.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

Now, the ```flight_airline``` dataframe has all of the delay info, cancellation info, airline codes, and airline names!

## Groupby

### Which airlines experience the most delays?

This question can be reworded as "find the # of delays by airline".

We can use the ```groupby``` function to do this!

In [ ]:
flight_airline.groupby(['carrier','carrier_name'])['DEP_DEL15'].sum().sort_values(ascending=False)

carrier  carrier_name
WN       Southwest Airlines Co.     13381.0
AA       American Airlines Inc.     11000.0
OO       SkyWest Airlines Inc.      10836.0
DL       Delta Air Lines Inc.        8095.0
UA       United Air Lines Inc.       6165.0
OH       Comair Inc.                 4656.0
MQ       Envoy Air                   4299.0
AS       Alaska Airlines Inc.        3863.0
B6       JetBlue Airways             3735.0
YX       Republic Airline            2964.0
YV       Mesa Airlines Inc.          2802.0
9E       Endeavor Air Inc.           2580.0
NK       Spirit Air Lines            2403.0
F9       Frontier Airlines Inc.      1888.0
G4       Allegiant Air               1376.0
EV       ExpressJet Airlines LLC     1284.0
HA       Hawaiian Airlines Inc.       557.0
Name: DEP_DEL15, dtype: float64

If the threshold is 10,000 delays in January, it seems that WN, AA, OO are the top three airlines that experience the most delays.
But oftentimes, passengers would care more about **arriving on time** and that's what airline companies focus more on.

### 8.0 - Now Try This

Calculate the sum of `ARR_DEL15` using the `groupby` function and sort the dataset in descending order.

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/8.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

If we use the same threshold of 10,000 delays, AA, OO, OH, and WN are airlines that experience the most delays in regards to **arrival**.

We've found the top airlines with most delays but this result does not take into account "Total number of flights."

So it will be more accurate if we can find the percentage of delayed flights for each airline.

```delayed flight % = (delayed flights) / (total flights)```

Let's calculate **delayed flight %**!

In [ ]:
# this code returns the total number of flights
flight_airline.groupby(['carrier','carrier_name'])['ARR_DEL15'].count()

carrier  carrier_name
9E       Endeavor Air Inc.           22955
AA       American Airlines Inc.      75472
AS       Alaska Airlines Inc.        20783
B6       JetBlue Airways             24621
DL       Delta Air Lines Inc.        79928
EV       ExpressJet Airlines LLC     10376
F9       Frontier Airlines Inc.      12312
G4       Allegiant Air                7663
HA       Hawaiian Airlines Inc.       7015
MQ       Envoy Air                   25284
NK       Spirit Air Lines            17333
OH       Comair Inc.                 23999
OO       SkyWest Airlines Inc.       69501
UA       United Air Lines Inc.       48019
WN       Southwest Airlines Co.     107708
YV       Mesa Airlines Inc.          17473
YX       Republic Airline            28826
Name: ARR_DEL15, dtype: int64

Using this formula, ```delayed flight % = (delayed flights) / (total flights)```, we will divide the number of delayed flights by total flights.

In [ ]:
# this code returns the percentage of delayed flights of each airline.
flight_airline.groupby(['carrier','carrier_name'])['ARR_DEL15'].sum() / flight_airline.groupby(['carrier','carrier_name'])['ARR_DEL15'].count()

carrier  carrier_name
9E       Endeavor Air Inc.          0.109562
AA       American Airlines Inc.     0.150360
AS       Alaska Airlines Inc.       0.211375
B6       JetBlue Airways            0.149263
DL       Delta Air Lines Inc.       0.105833
EV       ExpressJet Airlines LLC    0.154298
F9       Frontier Airlines Inc.     0.145793
G4       Allegiant Air              0.200705
HA       Hawaiian Airlines Inc.     0.098076
MQ       Envoy Air                  0.196923
NK       Spirit Air Lines           0.134656
OH       Comair Inc.                0.215259
OO       SkyWest Airlines Inc.      0.153840
UA       United Air Lines Inc.      0.129844
WN       Southwest Airlines Co.     0.095824
YV       Mesa Airlines Inc.         0.178447
YX       Republic Airline           0.118920
Name: ARR_DEL15, dtype: float64

Now, in order to see the top airlines with highest delay percentages, let's sort the result in descending order!

In [ ]:
# sort_values(ascending = False) has been added
(flight_airline.groupby(['carrier','carrier_name'])['ARR_DEL15'].sum() / flight_airline.groupby(['carrier','carrier_name'])['ARR_DEL15'].count()).sort_values(ascending = False)

carrier  carrier_name
OH       Comair Inc.                0.215259
AS       Alaska Airlines Inc.       0.211375
G4       Allegiant Air              0.200705
MQ       Envoy Air                  0.196923
YV       Mesa Airlines Inc.         0.178447
EV       ExpressJet Airlines LLC    0.154298
OO       SkyWest Airlines Inc.      0.153840
AA       American Airlines Inc.     0.150360
B6       JetBlue Airways            0.149263
F9       Frontier Airlines Inc.     0.145793
NK       Spirit Air Lines           0.134656
UA       United Air Lines Inc.      0.129844
YX       Republic Airline           0.118920
9E       Endeavor Air Inc.          0.109562
DL       Delta Air Lines Inc.       0.105833
HA       Hawaiian Airlines Inc.     0.098076
WN       Southwest Airlines Co.     0.095824
Name: ARR_DEL15, dtype: float64

Tada, we've come up with a completely different result!

OH, AS, G4 airlines have the highest delay percentages while 9E, DL, HA, WN have relatively low delay percentages.

#### `agg()`

The code above is correct but it's very lengthy because we calculate ```sum()``` and ```count()``` separately.

We will learn a shortcut to calculate aggregates using the ```agg()``` argument. (Refer to the material on Basic Data Manipulation with Pandas for a refresher on aggregate functions).

Everything remains the same, except that we replace ```sum()``` or ```count()``` with ```agg(['sum','count'])```.

In [ ]:
new_df = flight_airline.groupby(['carrier','carrier_name'])['ARR_DEL15'].agg(['sum','count'])
new_df

                                     sum   count
carrier carrier_name
9E      Endeavor Air Inc.         2515.0   22955
AA      American Airlines Inc.   11348.0   75472
AS      Alaska Airlines Inc.      4393.0   20783
B6      JetBlue Airways           3675.0   24621
DL      Delta Air Lines Inc.      8459.0   79928
EV      ExpressJet Airlines LLC   1601.0   10376
F9      Frontier Airlines Inc.    1795.0   12312
G4      Allegiant Air             1538.0    7663
HA      Hawaiian Airlines Inc.     688.0    7015
MQ      Envoy Air                 4979.0   25284
NK      Spirit Air Lines          2334.0   17333
OH      Comair Inc.               5166.0   23999
OO      SkyWest Airlines Inc.    10692.0   69501
UA      United Air Lines Inc.     6235.0   48019
WN      Southwest Airlines Co.   10321.0  107708
YV      Mesa Airlines Inc.        3118.0   17473
YX      Republic Airline          3428.0   28826

Now, ```new_df``` has columns: ```carrier```, ```carrier_name```, ```sum```, and ```count```.

We will create another column called ```delay %``` using sum and count columns!

In [ ]:
new_df['delay %'] = new_df['sum'] / new_df['count']

In [ ]:
new_df

                                     sum   count   delay %
carrier carrier_name
9E      Endeavor Air Inc.         2515.0   22955  0.109562
AA      American Airlines Inc.   11348.0   75472  0.150360
AS      Alaska Airlines Inc.      4393.0   20783  0.211375
B6      JetBlue Airways           3675.0   24621  0.149263
DL      Delta Air Lines Inc.      8459.0   79928  0.105833
EV      ExpressJet Airlines LLC   1601.0   10376  0.154298
F9      Frontier Airlines Inc.    1795.0   12312  0.145793
G4      Allegiant Air             1538.0    7663  0.200705
HA      Hawaiian Airlines Inc.     688.0    7015  0.098076
MQ      Envoy Air                 4979.0   25284  0.196923
NK      Spirit Air Lines          2334.0   17333  0.134656
OH      Comair Inc.               5166.0   23999  0.215259
OO      SkyWest Airlines Inc.    10692.0   69501  0.153840
UA      United Air Lines Inc.     6235.0   48019  0.129844
WN      Southwest Airlines Co.   10321.0  107708  0.095824
YV      Mesa Airlines Inc.        3118.0   17473  0.178447
YX      Republic Airline          3428.0   28826  0.118920

Tada! We've successfully added a ```delay %``` column! Let's sort the dataframe in descending order to find out airlines with highest delay %!

In [ ]:
new_df.sort_values(by=['delay %'], ascending=False)

                                     sum   count   delay %
carrier carrier_name
OH      Comair Inc.               5166.0   23999  0.215259
AS      Alaska Airlines Inc.      4393.0   20783  0.211375
G4      Allegiant Air             1538.0    7663  0.200705
MQ      Envoy Air                 4979.0   25284  0.196923
YV      Mesa Airlines Inc.        3118.0   17473  0.178447
EV      ExpressJet Airlines LLC   1601.0   10376  0.154298
OO      SkyWest Airlines Inc.    10692.0   69501  0.153840
AA      American Airlines Inc.   11348.0   75472  0.150360
B6      JetBlue Airways           3675.0   24621  0.149263
F9      Frontier Airlines Inc.    1795.0   12312  0.145793
NK      Spirit Air Lines          2334.0   17333  0.134656
UA      United Air Lines Inc.     6235.0   48019  0.129844
YX      Republic Airline          3428.0   28826  0.118920
9E      Endeavor Air Inc.         2515.0   22955  0.109562
DL      Delta Air Lines Inc.      8459.0   79928  0.105833
HA      Hawaiian Airlines Inc.     688.0    7015  0.098076
WN      Southwest Airlines Co.   10321.0  107708  0.095824

### Which day of the week experiences the most delays? 

This question can be rephrased as "find the # of delays by day of week".

To answer this question, we can use the `groupby` function, but should we use ```sum```? ```count```? ```mean```?

- ```sum```: The first thing that came to my mind is that we can use ```sum```. But similar to the question above, each day of the week has a different number of flights per day. (Ex: there would be more flights scheduled on weekends.) So, ```sum``` is not the most appropriate function to use here.


- ```count```: We can count the number of flights and divide ```sum(delayed flights)``` by ```count``` (similar to what we just did).


- ```mean```: What if we use ```mean```? We can get the average delay percentage of each day and this is what we are looking for!

In [ ]:
flight_airline.groupby(['DAY_OF_WEEK'])['ARR_DEL15'].mean()

DAY_OF_WEEK
1    0.133963
2    0.098135
3    0.097656
4    0.137520
5    0.161769
6    0.211572
7    0.135598
Name: ARR_DEL15, dtype: float64

To confirm that ```mean``` returns the same value as ```sum / count```, let's check ```sum / count``` real quick.

In [ ]:
flight_airline.groupby(['DAY_OF_WEEK'])['ARR_DEL15'].sum() / flight_airline.groupby(['DAY_OF_WEEK'])['ARR_DEL15'].count()

DAY_OF_WEEK
1    0.133963
2    0.098135
3    0.097656
4    0.137520
5    0.161769
6    0.211572
7    0.135598
Name: ARR_DEL15, dtype: float64

Yay! It returns the same answer as above!

Saturday has the highest delay percentage while Wednesday has the lowest!

### What origins experience most delays? 

This question can be rephrased as "find the # of delays by origin".

Knowing this might help when we book a flight later! :)

Since we are dealing with the **origin** airport at this time, it's appropriate to use ```DEP_DEL15```.

In [ ]:
flight_airline.groupby(['ORIGIN'])['DEP_DEL15'].mean()

ORIGIN
ABE    0.178273
ABI    0.190184
ABQ    0.099070
ABR    0.250000
ABY    0.059524
         ...
WRG    0.189655
XNA    0.119005
XWA    0.238806
YAK    0.211538
YUM    0.139785
Name: DEP_DEL15, Length: 351, dtype: float64

In [ ]:
flight_airline.groupby(['ORIGIN'])['DEP_DEL15'].mean().sort_values(ascending=False)

ORIGIN
ADK    0.333333
OTH    0.333333
OGD    0.333333
PPG    0.333333
ASE    0.303813
         ...
CPR    0.038095
CDC    0.037037
UIN    0.000000
COD    0.000000
OWB    0.000000
Name: DEP_DEL15, Length: 351, dtype: float64

This resulting Series shows origin airports and the corresponding delay %.

Since we don't know all of the airport names from the codes, we can join this Series to the dataset that has airport codes and the rest of the airport names.

## Filtering based on condition

### Which origin airports have delay percentages of 30% or more?

```airline_delay_causes.csv``` has lots of useful information, but we will extract airport codes and airport names only.

In [ ]:
url = 'https://raw.githubusercontent.com/bitprj/DigitalHistory/master/Week6-Advanced-Data-Wrangling-using-Pandas/data/airline_delay_causes.csv'
airport_codes = pd.read_csv(url)
airport_codes

        year   month carrier  ... security_delay late_aircraft_delay Unnamed: 21
0       2004       1      DL  ...           15.0              2116.0         NaN
1       2004       1      DL  ...            0.0               719.0         NaN
2       2004       1      DL  ...            0.0               809.0         NaN
3       2004       1      DL  ...            0.0               780.0         NaN
4       2004       1      DL  ...            0.0               837.0         NaN
...      ...     ...     ...  ...            ...                 ...         ...
279177  2019       1      MQ  ...            0.0              2559.0         NaN
279178  2019       1      MQ  ...            0.0               260.0         NaN
279179  2019       1      MQ  ...            0.0               363.0         NaN
279180  2019       1      MQ  ...            0.0               677.0         NaN
279181  2019       1      MQ  ...            0.0                15.0         NaN

[279182 rows x 22 columns]

In [ ]:
airport_codes.head()

   year   month carrier  ... security_delay late_aircraft_delay Unnamed: 21
0  2004       1      DL  ...           15.0              2116.0         NaN
1  2004       1      DL  ...            0.0               719.0         NaN
2  2004       1      DL  ...            0.0               809.0         NaN
3  2004       1      DL  ...            0.0               780.0         NaN
4  2004       1      DL  ...            0.0               837.0         NaN

[5 rows x 22 columns]

### 9.0 - Now Try This

- Using the ```drop_duplicates()``` function, find a unique set of airport codes and airport names. 
- Save the dataframe as ```airport_names```.

In [ ]:
# Once your have verified your answer please uncomment the line below and run it, this will save your code 
#%%writefile -a {folder_location}/9.py
# Please note that if you uncomment and run multiple times, the program will keep appending to the file.


# INSERT CODE HERE

The Series below is what we have found earlier -- delay % by each origin airport.

In [ ]:
series = flight_airline.groupby(['ORIGIN'])['DEP_DEL15'].mean().sort_values(ascending=False)
series

ORIGIN
ADK    0.333333
OTH    0.333333
OGD    0.333333
PPG    0.333333
ASE    0.303813
         ...
CPR    0.038095
CDC    0.037037
UIN    0.000000
COD    0.000000
OWB    0.000000
Name: DEP_DEL15, Length: 351, dtype: float64

Let's convert the result of `groupby` aggregation to a ```DataFrame``` using the ```to_frame()``` function.

In [ ]:
origin_delays = series.to_frame()

In [ ]:
origin_delays

        DEP_DEL15
ORIGIN
ADK      0.333333
OTH      0.333333
OGD      0.333333
PPG      0.333333
ASE      0.303813
...           ...
CPR      0.038095
CDC      0.037037
UIN      0.000000
COD      0.000000
OWB      0.000000

[351 rows x 1 columns]

Now, let's take a closer look at the question and break it down into smaller subproblems!

**Which airports have delay percentages of 30% or more?**
1. Find airport codes with a delay percentage greater than 30%.
2. Join the resulting dataframe to ```airport_names``` to get the corresponding airport names for these codes.

In [ ]:
airports_most_delays = origin_delays[origin_delays['DEP_DEL15'] > 0.3]
airports_most_delays

        DEP_DEL15
ORIGIN
ADK      0.333333
OTH      0.333333
OGD      0.333333
PPG      0.333333
ASE      0.303813

In [ ]:
pd.merge(airports_most_delays, airport_names, left_on="ORIGIN", right_on = "airport")

   DEP_DEL15 airport                                       airport_name
0   0.333333     ADK                              Adak Island, AK: Adak
1   0.333333     OTH  North Bend/Coos Bay, OR: Southwest Oregon Regi...
2   0.333333     OGD                          Ogden, UT: Ogden-Hinckley
3   0.333333     PPG             Pago Pago, TT: Pago Pago International
4   0.303813     ASE         Aspen, CO: Aspen Pitkin County Sardy Field

We've found that ADK, OTH, OGD, PPG, and ASE have the highest delay percentages in the US!

### Pop-up Question

What if we want to find the delay percentage of a specific airport? Then, we can select the origin airport code by using ```df[df[column_name]=="ABC"]```

Let's check out the delay % of San Francisco airport.

In [ ]:
origin_delays[origin_delays['ORIGIN'] == 'SFO']

KeyError: ignored

The code above did not work! Why? It's because ```ORIGIN``` is not a column, but an index.

In this case, we are interested in an index and so we can use ```index``` to select it.

In [ ]:
origin_delays[origin_delays.index == 'SFO']

        DEP_DEL15
ORIGIN
SFO      0.171547


## Submission
Run this code block to download your answers.

In [ ]:
from google.colab import files
!zip -r "{student_id}.zip" "{student_id}"
files.download(f"{student_id}.zip")

## Resources
- [Python Pandas Series](https://www.geeksforgeeks.org/python-pandas-series/)
- [Pandas API Reference Merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html)
- [Join types](https://www.codespot.org/sql-join/)
- [Flight Delay Prediction data](https://www.kaggle.com/divyansh22/flight-delay-prediction)
- [Airline Delay Causes](https://www.kaggle.com/anshuls235/airline-delay-causes)